#pragma once

#include "base.h"
#include "fixstring.h"
#include "wow_enums.h"
#include <map>
#include <vector>

class wowEnvironment;
class IMemFile;
class ItemCollections;

namespace WowClassic
{
#	pragma pack (4)

	struct dbcHeader {
		/*0x00*/    char      _magic[4];	// "WDBC"
		/*0x04*/    uint32_t  _nRecords;        //
		/*0x08*/    uint32_t  _nFields;      	//
		/*0x0C*/    uint32_t  _recordSize;      //
		/*0x10*/    uint32_t  _stringsize;
	};

	struct db2Header
	{
		/*0x00*/    char      _magic[4];	// "WDB2"
		/*0x04*/    uint32_t  _nRecords;        //
		/*0x08*/    uint32_t  _nFields;      	//
		/*0x0C*/    uint32_t  _recordSize;      //
		/*0x10*/    uint32_t  _stringsize;
		uint32_t hash;
		uint32_t clientminor;		//version
		uint32_t unknown1;
		uint32_t min_id;
		uint32_t max_id;
		uint32_t localecode;
		uint32_t refdatasize;
	};

#	pragma pack ()

	class dbc
	{
	private:
		DISALLOW_COPY_AND_ASSIGN(dbc);

	public:
		dbc(const wowEnvironment* env, const char* filename, bool tmp = false);
		virtual ~dbc();

	protected:
		void readWDBC(const wowEnvironment* env, IMemFile* file, bool tmp);
		void readWDB2(const wowEnvironment* env, IMemFile* file, bool tmp);

	public:
		class record
		{
		public:
			static record EMPTY() { static record m(nullptr, -1, nullptr, 0); return m; }

			bool isValid() const { return _ofs != nullptr; }

			uint32_t getID() const
			{
				return getUInt(0);
			}

			float getFloat(uint32_t idx) const
			{
				ASSERT(idx < _dbc->getNumFields());
				return *reinterpret_cast<float*>(_ofs + idx * 4);
			}

			uint32_t getUInt(uint32_t idx) const
			{
