#pragma once

#include "base.h"
#include "fixstring.h"
#include <unordered_map>
#include <map>
#include <vector>

class wowEnvironment;
class IMemFile;

#	pragma pack (4)

struct dbcHeader {
	/*0x00*/    char      _magic[4];	// "WDBC"
	/*0x04*/    u32  _nRecords;        // 	  
	/*0x08*/    u32  _nFields;      	// 
	/*0x0C*/    u32  _recordSize;      // 
	/*0x10*/    u32  _stringsize;   
};

struct db2Header
{
	/*0x00*/    char      _magic[4];	// "WDB2"
	/*0x04*/    u32  _nRecords;        // 	  
	/*0x08*/    u32  _nFields;      	// 
	/*0x0C*/    u32  _recordSize;      // 
	/*0x10*/    u32  _stringsize;   
	u32 hash;
	u32 clientminor;		//version
	u32 unknown1;
	u32 firstrow;
	u32 lastrow;
	u32 localecode;
	u32 refdatasize;
};

#define WDB5_FLAG_DATAOFFSET 1
#define WDB5_FLAG_UNKNOWN 2
#define WDB5_FLAG_INDEX 4

struct db5Header
{
	/*0x00*/    char      _magic[4];	// "WDB5"
	/*0x04*/    u32  _nRecords;        // 	  
	/*0x08*/    u32  _nFields;      	// 
	/*0x0C*/    u32  _recordSize;      // 
	/*0x10*/    u32  _stringsize; 

	u32 tablehash;
	u32 layouthash;
	u32 firstrow;
	u32 lastrow;
	s32 localecode;
	u32 refdatasize;
	u16 fileflags;		
	u16 idindex;
};

#	pragma pack ()

class dbc 
{
private:
	DISALLOW_COPY_AND_ASSIGN(dbc);

public:
	dbc(wowEnvironment* env, const c8* filename, bool tmp=false);
	virtual ~dbc();

protected:
	void readWDBC(wowEnvironment* env, IMemFile* file, bool tmp);
	void readWDB2(wowEnvironment* env, IMemFile* file, bool tmp);
	void readWDB5(wowEnvironment* env, IMemFile* file, bool tmp);

public:
	class record
	{
	public:
		static record EMPTY() { static record m(NULL_PTR, -1, NULL_PTR, 0); return m; }

		bool isValid() const { return _ofs != NULL_PTR; }

		u32 getID() const
		{
			if (!_dbc->Fields)
				return getUInt(0);

			ASSERT(_dbc->hasIndex() && _index >= 0);
			return _dbc->getIDs()[_index];
		}

		f32 getFloat(u32 idx) const 
		{
			ASSERT(idx < _dbc->getNumFields());
			if(!_dbc->Fields)
