#pragma once

#include "base.h"
#include "fixstring.h"
#include <unordered_map>
#include <map>
#include <vector>

class wowEnvironment;
class IMemFile;
class ItemCollections;

namespace WowClassic
{
#	pragma pack (4)

	struct dbcHeader {
		/*0x00*/    char      _magic[4];	// "WDBC"
		/*0x04*/    u32  _nRecords;        //
		/*0x08*/    u32  _nFields;      	//
		/*0x0C*/    u32  _recordSize;      //
		/*0x10*/    u32  _stringsize;
	};

	struct db2Header
	{
		/*0x00*/    char      _magic[4];	// "WDB2"
		/*0x04*/    u32  _nRecords;        //
		/*0x08*/    u32  _nFields;      	//
		/*0x0C*/    u32  _recordSize;      //
		/*0x10*/    u32  _stringsize;
		u32 hash;
		u32 clientminor;		//version
		u32 unknown1;
		u32 min_id;
		u32 max_id;
		u32 localecode;
		u32 refdatasize;
	};

#	pragma pack ()

	class dbc
	{
	private:
		DISALLOW_COPY_AND_ASSIGN(dbc);

	public:
		dbc(wowEnvironment* env, const c8* filename, bool tmp = false);
		virtual ~dbc();

	protected:
		void readWDBC(wowEnvironment* env, IMemFile* file, bool tmp);
		void readWDB2(wowEnvironment* env, IMemFile* file, bool tmp);

	public:
		class record
		{
		public:
			static record EMPTY() { static record m(nullptr, -1, nullptr, 0); return m; }

			bool isValid() const { return _ofs != nullptr; }

			u32 getID() const
			{
				return getUInt(0);
			}

			f32 getFloat(u32 idx) const
			{
				ASSERT(idx < _dbc->getNumFields());
				return *reinterpret_cast<float*>(_ofs + idx * 4);
			}

			u32 getUInt(u32 idx) const
			{
				ASSERT(idx < _dbc->getNumFields());
